[MMSoldierListHelper]
m_strSortListLabel=SORT LIST
m_strReverseOrderLabel=REVERSE ORDER
m_strSelectOrderLabel=SELECT ORDER

[MiniModsStrategy]
m_strClearPerksButton="CLEAR PERKS"
m_strClearPerksTitle="CLEAR PERKS"
m_strClearPerksWarning="All perk choices for the soldier will be cleared so that you can make new ones. However any stat bonuses coming from new perks will be ignored. Training new skills causes <XGParam:IntValue0> days of fatigue for the soldier and next such training will be available after <XGParam:IntValue1> missions. <XGParam:StrValue1/>Proceed?"
m_strClearPerksConfirm="CONFIRM"
m_strClearPerksCancel="CANCEL"
m_strClearPerksNeedMeld="This procedure consumes <XGParam:IntValue2/> MELD."

m_strMeldHealButton="BOOST HEALING"
m_strMeldHealDesc="You can cut healing time by <XGParam:IntValue0/> days (not below <XGParam:IntValue1/> days) for <XGParam:IntValue2/> MELD per charge."
m_strMeldHealFatiguePurge="You can remove fatigue for <XGParam:IntValue2/> MELD."
m_strMissingInInventory="MISSING IN INVENTORY"
m_strPerkGivesItemCharges="Grants free (or additional) usage of the following items:"

m_strAlienResourcesLabel=Alien Resources
m_strAlienResearchLabel=Alien Research
m_strAlienResourceLvlLabel=Alien Resource Lvl
m_strXComThreatLabel=XCom Threat

[MiniModsTactical]
m_strSalvageTitle="Choose salvage option"
m_strSalvageBody="We can hire additional salvage teams for <XGParam:StrValue0/> credits, to recover extra resources (<XGParam:IntValue0/> elerium and <XGParam:IntValue1/> alloys).\nCurrent cash balance is: <XGParam:StrValue1/>."
m_strSalvageAccept="Confirm"
m_strSalvageCancel="No, thanks"
m_strShadowStepping="Shadow Step"
m_strShadowStepBuster="Shadow Buster"
m_strShadowStepBuffDesc="This unit does not trigger enemy's reaction fire"
m_strShadowStepDashSuffix=" while dashing"
m_strShadowStepMoveSuffix=" while moving"
m_strReactionBlockedBySmoke="- could not take reaction shot due to smoke."

m_strScoutSenseName="Scout Sense"
m_strScoutSenseHelp="Sharpen senses to hear nearest enemies."
m_strScoutSenseRest="Take rest"
m_strScoutSensePerkDesc="Sharpened senses allow this soldier to point direction to nearest enemies. The skill improves with the rank of soldier."
m_strDistanceInTiles="Distance in tiles:"
m_strScoutSenseMessage[0]="Very close"
m_strScoutSenseMessage[1]="Close"
m_strScoutSenseMessage[2]="Not far"
m_strScoutSenseMessage[3]="Quite Far"
m_strScoutSenseMessage[4]="Far"
m_strScoutSenseMessage[5]="Very far"
m_strScoutSenseMessage[6]=""

m_strGameSpeed=Game Speed

[MiniModsOptionsContainer]
m_arrCreditsMiniMods=<h1>MINI MODS\n(dla XCom EW oraz LW)</h1>
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods=<h2>AUTHOR</h2>
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods=Szymon 'szmind' Zminda
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods=<h3>Design and programming</h3>
m_arrCreditsMiniMods='szmind'
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods=<h3>Testers</h3>
m_arrCreditsMiniMods='kdm2k6' (priceless initial tests of gamepad support)
m_arrCreditsMiniMods='UCross'
m_arrCreditsMiniMods='fjz' aka 'sol999
m_arrCreditsMiniMods='datar0'
m_arrCreditsMiniMods='Snackhound'
m_arrCreditsMiniMods='Loriendal'
m_arrCreditsMiniMods='Lafiir'
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods=<h3>Debugging</h3>
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods='szmind'
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods=<h3>Translators</h3>
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods='Loriendal' (Russian)
m_arrCreditsMiniMods='SvartirMaidenRuby aka Ruby Jabberwocky' (Spanish)
m_arrCreditsMiniMods='szmind' (Polish)
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods=<h3>Special thanks to:</h3>
m_arrCreditsMiniMods='AzXeus' - for introducing me into scripting with UDK (Unreal Development Kit)
m_arrCreditsMiniMods='Lafiir' - for in-depth tests of gamepad support and perfect bug reporting
m_arrCreditsMiniMods=""
m_arrCreditsMiniMods=<h3>Contact</h3>
m_arrCreditsMiniMods=szmind@gmail.com\nDiscord: szmind#7068

m_arrCreditsMapOrganizer=<h1>ABDUCTIONS MAP ORGANIZER</h1>
m_arrCreditsMapOrganizer=""
m_arrCreditsMapOrganizer=<h2>Map analysis and segregation</h2>
m_arrCreditsMapOrganizer=""
m_arrCreditsMapOrganizer='Snackhound'
m_arrCreditsMapOrganizer=""
m_arrCreditsMapOrganizer=<h3>Programming</h3>
m_arrCreditsMapOrganizer='szmind'
m_arrCreditsMapOrganizer=""

m_arrVarName=ManufactureExaltLoot
m_arrVarFriendlyName=Manufacture Exalt Loot
m_arrVarDescription=Allows manufacturing of unique items gained after raiding EXALT base: <XGParam:StrValue0/>, <XGParam:StrValue1/> and <XGParam:StrValue2/>. Select which of them (some or all) can be built as well as set corresponding cost/time variables.

m_arrVarName=ManufactureExaltLoot.BuildItem
m_arrVarFriendlyName=""
m_arrVarDescription=Enable/disable <XGParam:StrValue0/> for manufacturing. 

m_arrVarName=ManufactureExaltLoot.iTime
m_arrVarFriendlyName=""
m_arrVarDescription=Number of days required to build <XGParam:StrValue0/> with the required number of engineers.\n\nProduction time scales with the number of engineers. It is longer without the required number of  engineers or shorter with more than required.\nDefault value is 10 (or the positive value from DefaultGameCore.ini).\n<FONT COLOR='#FF0000'>WARNING: in case -1 is displayed you should click "Restore Defaults". Leaving -1 will render the item unavailable for production (even if enabled with the checkbox).</FONT>

m_arrVarName=ManufactureExaltLoot.iEng
m_arrVarFriendlyName=""
m_arrVarDescription=Number of engineers required to build <XGParam:StrValue0/> within the set number of days.\n\nProduction time scales with the number of engineers. It is longer without the required number of engineers or shorter with more than required.\nDefault value is 70 (or the positive value from DefaultGameCore.ini).\n<FONT COLOR='#FF0000'>WARNING: in case -1 is displayed you should click "Restore Defaults". Leaving -1 will render the item unavailable for production (even if enabled with the checkbox).</FONT>

m_arrVarName=MapImageOnSquadSelect
m_arrVarFriendlyName=Map Image On Squad Select
m_arrVarDescription=Shows map image on Squad Select screen (the very same image which will is used for tactical save on the mission). Lets easily recognize what map the mission will take place on. You can add a requirement of sat coverage over the continent where the mission is taking place.

m_arrVarName=MapImageOnSquadSelect.m_bMapImageRequiresSat
m_arrVarFriendlyName=Requires Sat Coverage
m_arrVarDescription=The map image will only appear if you have satellite over the continent where the mission is taking place.

m_arrVarName=MapImageOnSquadSelect.m_bMapImageOnlyOnce
m_arrVarFriendlyName=Show map only one time
m_arrVarDescription=Turn this option ON and the map image will be shown only one time for each mission - when you enter Squad Select for the first time after mission's alert or after loading a save.\nThis option can be tick off during a running game and the change will have immediate effect.

m_arrVarName=StripGearButton
m_arrVarFriendlyName=Strip Gear Anytime
m_arrVarDescription=Adds <XGParam:StrValue0/> button on normal soldier's loadout view in barracks (not only on Squad Select screen).

m_arrVarName=MeldHealing
m_arrVarFriendlyName=MELD-Boost Healing
m_arrVarDescription=With this mod MELD can be used to speed up healing of soldiers. Appropriate button will be added to standard soldier's view in barracks - only for wounded (or fatigued) soldiers. Short info about the cost and effect will be displayed at top of screen. The feature can optionally require completing a certain research project. Other options include defining meld cost or the cut in healing time. The mod can be also disabled for SHIVs.

m_arrVarName=MeldHealing.MELDHEAL_DAYS_PER_CHARGE
m_arrVarFriendlyName=Time cut in days
m_arrVarDescription=This is the number of days removed from healing time with each injection of MELD.

m_arrVarName=MeldHealing.MELDHEAL_FRACTION_PER_CHARGE
m_arrVarFriendlyName=Time cut in %
m_arrVarDescription=Healing time will be cut by this % with each injection of MELD. If "Time cut in days" is set above 0 then the % cut takes place first and then "Time cut in days" is applied. The game will auto-calculate total reduction for each wounded soldier and display appropriate info.

m_arrVarName=MeldHealing.MELDHEAL_MELD_PER_CHARGE
m_arrVarFriendlyName=MELD cost per charge
m_arrVarDescription=Each injection will cost this amount of MELD. Without enough MELD the button will still appear but will be disabled. 

m_arrVarName=MeldHealing.MELDHEAL_MINIMUM_WOUND_DAYS
m_arrVarFriendlyName=Minimum Healing Time
m_arrVarDescription=Healing time cannot be set below this number of days. Setting 0 is allowed but healing a soldier fully with MELD may still require 1 hour to sign out the soldier from infirmary.

m_arrVarName=MeldHealing.MELDHEAL_FATIGUE_PURGE
m_arrVarFriendlyName=Purge fatigue status
m_arrVarDescription=Checking this option will make each MELD injection remove fatigued status from a soldier.

m_arrVarName=MeldHealing.MELDHEAL_CONFIRM_POPUP
m_arrVarFriendlyName=Confirmation Pop-Up
m_arrVarDescription=Checking this option forces a pop-up warning to confirm every injection of MELD. This helps prevent random clicking on the button.

m_arrVarName=MeldHealing.MELDHEAL_TECH_REQUIRED
m_arrVarFriendlyName=Required technology
m_arrVarDescription=Select the research project which must be completed before you will be able to use MELD for healing purposes.

m_arrVarName=MeldHealing.bShowMeldHealInfo
m_arrVarFriendlyName=Show calculation info
m_arrVarDescription=Turns on/off visibility of the message at top of the screen in barracks.

m_arrVarName=MeldHealing.MELDHEAL_NOT_FOR_SHIVS
m_arrVarFriendlyName=Not For SHIVs
m_arrVarDescription=Disables MELD healing (repairing) of SHIVs.

m_arrVarName=ClearPerks
m_arrVarFriendlyName=Soldiers' Respec Training
m_arrVarDescription=Allows to clear perks of a soldier who has enough mission count. It will make the soldier unavailable for several days or weeks. The procedure does not clear gene mods or psi perks, or medal-derived perks, or MEC's innate perks. It only clears "standard" perks and does not clear 1st level perk (so that you cannot change soldier's class). The code ensures that you gain no stats during such a respecification. Therefore any stat bonuses coming from new perks will be ignored. If the soldier has a valid pending promotion while clicking Clear Perks button (level earned but the perk not yet assigned) the respecification procedure should end accordingly (on last by one level) allowing the soldier to normally level up with that last perk choice.\n<FONT COLOR='#00FF00'>The soldier must be re-trained in one shot - partial changes (like assigning a few perks and leaving the rest for later) will be discarded.</FONT> In such case no cost will be applied and no changes will be made to the soldier's build. Navigation buttons are disabled during the re-picking of perks (to prevent breaking the procedure by accident) but you can still use Esc on keyboard and probably Esc-equivalent gamepad button. During re-training procedure Clear Perks button can be freely pressed numerous times - no cost will be applied until the procedure is finished and only the cost of ONE click will be applied.\nBy default the cost is 14 days of fatigue and 10 missions interval before the next re-training. Cost in MELD can be added to the procedure and optionally the feature can be locked behind a certain OTS upgrade.

m_arrVarName=ClearPerks.CLEARPERKS_MISSIONS_INTERVAL
m_arrVarFriendlyName=Missions Interval
m_arrVarDescription=Soldier must complete at least this number of missions to be eligible for the next re-training.\n\nDefaults to 10 missions.

m_arrVarName=ClearPerks.CLEARPERKS_TIMEOUT_DAYS
m_arrVarFriendlyName=Timeout in days
m_arrVarDescription=Soldier will be unavailable for this number of days after re-training procedure.\n\nDefaults to 14 days.

m_arrVarName=ClearPerks.CLEARPERKS_MELD_COST
m_arrVarFriendlyName=MELD cost per charge
m_arrVarDescription=Re-training of a soldier will consume this amount of MELD.\n\nDefault: 0.

m_arrVarName=ClearPerks.CLEARPERKS_OTS_REQ
m_arrVarFriendlyName=OTS upgrade required
m_arrVarDescription=Re-training of soldiers will require unlocking this OTS upgrade.\n\nDefaults to "None".

m_arrVarName=AbductionMapOrganizer
m_arrVarFriendlyName=Abduction Map Manager
m_arrVarDescription=Allows for settting a maximum difficulty of abductions mission for each map. Swarming abductions on gas station or fast food, or bar map can be problematic - this mod solves the problem. By default the mod stops Hard and Swarming abductions appear on smaller maps. The patient job of defining default settings has been done by 'Snackhound'.\n\n<FONT COLOR='#00FF00'>Credits to 'Snackhound'.</FONT>

m_arrVarName=AbductionMapOrganizer.AbductionMapRules
m_arrVarFriendlyName=""
m_arrVarDescription=Sets maximum acceptable difficulty for the map. In order to make the map NOT appear for higher difficulties (of abduction) the maximum difficulty should be set at lower level. The larger the map the higher acceptable difficulty should be. 

m_arrVarName=OfficerIronWill
m_arrVarFriendlyName=Officer's Iron Will
m_arrVarDescription=Extends range of innate officer's ability which is "granting the officer's Will stat to nearby soldiers". With this mod it is 18 tiles by default (it used to be 8 tiles). However a different range can be set in the mod's options.

m_arrVarName=OfficerIronWill.OTS_LEADER_RANGE
m_arrVarFriendlyName=Range of Will Sharing
m_arrVarDescription=Set the range (in tiles) to extend the distance at which the officer grants his Will to team-mates. However values below 8 do not cut the range (8 is ensured by native code and cannot be lower). Setting 0 will NOT disable sharing of Will - 0 is treated as 8 (default).

m_arrVarName=FuelConsumption
m_arrVarFriendlyName=Realistic Fuel Consumption
m_arrVarDescription=Makes flying units not stay in the air forever with empty fuel tank. With realistic fuel consumption 1 fuel is consumed after every turn in the air. The consumption takes place at the begining of player's turn. If unit's fuel drops to 0 the unit will automatically land when player switches to it.\n\nOptionally the active unit's fuel will be announced whenever the unit is selected, so not only after a move (this way you know fuel reserves BEFORE moving).\nYou can choose one or both of the above features in mod's options.

m_arrVarName=FuelConsumption.m_bFuelConsumption
m_arrVarFriendlyName=Fuel consumption
m_arrVarDescription=Check this option to have 1 fuel consumed after every turn in the air. The consumption takes place at begining of human player's turn. If unit's fuel drops to 0 the unit will automatically land when you switch to it.

m_arrVarName=FuelConsumption.m_bFuelAnnounceBeginTurn
m_arrVarFriendlyName=Fuel pop-up
m_arrVarDescription=Check this option and unit's current fuel will be announced whenever the unit is selected - not only after a move (so that you know fuel reserves BEFORE moving).

m_arrVarName=FuelConsumption.ADJUST_FUEL_MULTIPLIER
m_arrVarFriendlyName=Fuel adjustment factor
m_arrVarDescription=Standard fuel provided by Archangel armor or a flying SHIV does not last for long with realistic fuel consumption. Therefore this easy-to-use multiplier of all flying fuel will be applied to all flying units at start of every battle. Default setting is 2.0 which means that standard fuel reserves will be doubled. Any changes to the multiplier require a new mission or restarting the current mission. This way the multiplier cannot be used to add fuel during a mission.\n<FONT COLOR='#00FF00'>Alternatively - standard fuel for each type of flying armor/SHIV can be manually adjusted in DefaultGameCore.ini - in such case the multiplier should be set to 1.0.</FONT>

m_arrVarName=DisorientExalt
m_arrVarFriendlyName=Disorient EXALT With Radar
m_arrVarDescription=With this mod turned on - when the covert operative hacks a radar array all EXALT units get Disoriented status instead of having their guns disabled (as if all EXALT have been hit by flashbang grenade).\n\nThe aim penalty and duration of the effect can be both customized in the mod's options.\n\nThere is also an option to set % chance to apply the effect randomly (not on every EXALT unit).

m_arrVarName=DisorientExalt.m_bRevealAll
m_arrVarFriendlyName=Hacking reveals all
m_arrVarDescription=Makes all unrevealed EXALT units be revealed after hacking a radar array.

m_arrVarName=DisorientExalt.m_bUnlimitedArrayHacks
m_arrVarFriendlyName=Speedy Gonzales
m_arrVarDescription=Allows for activation of 2 radar arrays in one turn (to take advantage of a really fast operative).

m_arrVarName=DisorientExalt.FLASH_BOMB_AIM_PENALTY
m_arrVarFriendlyName=Aim penalty
m_arrVarDescription=Set the amount of aim penalty to be applied to all EXALT after hacking a radar array. The effect does not stack when 2 radar arrays are hacked with "Speedy Gonzales" turned ON.

m_arrVarName=DisorientExalt.FLASH_BOMB_TURNS_AFFECTING
m_arrVarFriendlyName=Duration of the effect
m_arrVarDescription=Set the number of EXALT turns during which enemies will remain disoriented after hacking a radar array. Hacking another array resets the counter back to this value.\nEXAMPLE: The duration is set to 2. After hacking a radar EXALT have their turn and all suffer from disorientation. Then on human's turn another radar is hacked by the operative. Previous effect is removed from EXALT and they are yet again hit by the new "flashbang" - thus have the counter set back to 2 turns.

m_arrVarName=DisorientExalt.FLASH_BOMB_CHANCE_AFFECTING
m_arrVarFriendlyName=Chance to trigger
m_arrVarDescription=Set the percent chance (per EXALT unit) that a unit will get Disoriented status. The test is done on each unit separately. If the chance is lower than 100 some EXALT will get disoriented while others will not.

m_arrVarName=MiscMiniMods
m_arrVarFriendlyName=Mini UI Helpers
m_arrVarDescription=A pack of small UI additions not necessarily changing any mechanics - just providing additional useful info like alien resources, numeric ammo counter, turn number indicator etc.

m_arrVarName=MiscMiniMods.m_bTilesCounterPopUp
m_arrVarFriendlyName=Tiles To Target Pop-Up
m_arrVarDescription=A small QoL addition - each time an enemy is targeted a small pop-up tells the distance (in tiles) to the target. Useful to determine, for instance, if Close Encounters will trigger or how far the target is for determining distance-based aim bonus/penalty.

m_arrVarName=MiscMiniMods.m_bTurnCounter
m_arrVarFriendlyName=Turn Counter
m_arrVarDescription=At start of each turn current turn's number will be displayed. Useful when using mods relying on mission's length (like Green Fog).

m_arrVarName=MiscMiniMods.m_bContinentalFellowArchives
m_arrVarFriendlyName=Continental Fellow Archives
m_arrVarDescription=Provides information about games completed after starting on each of continents. It helps to complete the achievement of "Continental Fellow" (for winning the game after starting from each of the continents). The info is displayed as a report in Research Archives. Load any savegame within strategy layer, go to research archives and scroll down the list - at the very end of the list you will find the report.

m_arrVarName=MiscMiniMods.m_bShowAlienResources
m_arrVarFriendlyName=Show Alien Resources
m_arrVarDescription=Addition to Situation Room - exposes hidden game data: alien research, alien resources and XCom Threat.

m_arrVarName=MiscMiniMods.m_bSquadSelectProgress
m_arrVarFriendlyName=Squad Select Progress
m_arrVarDescription=""

m_arrVarName=MiscMiniMods.m_bSquadSelectProgressShowBar
m_arrVarFriendlyName=Show Progress Bar
m_arrVarDescription=""

m_arrVarName=MiscMiniMods.m_bSquadSelectProgressShowTxt
m_arrVarFriendlyName=Show Numerical Info
m_arrVarDescription=""

m_arrVarName=SalvageMod
m_arrVarFriendlyName=Extra Salvage Teams
m_arrVarDescription=At the end of some missions (defined in options) you will be offered to hire additional salvage teams to retrieve more elerium and alloys (by default 50% more). The bonus amounts are disclosed as well as the cost of whole operation, and current cash balance. However, if the mod is turned ON during an ongoing mission the cash balance will be telling 0 (current cash balance is recorded during Squad Select for the mission).\n\nThe price for each extra piece of elerium/alloys can be set in mod's options but by default it is double the selling price on Grey Market (the mod will simply read it from DefautGameCore.ini and multiply by 2). If you do not have enough money you can still accept the offer - in such case your cash balance will go negative after returning from mission.\n\nHaving Salvage Teams enabled on every mission is not realistic (like terror or abduction). However, all types of "allowed" missions are selectible in mod's options. Default setting is to allow Salvage Teams on: UFO missions, Alien base, EXALT base raid, EXALT data recovery mission.

m_arrVarName=SalvageMod.bRandomizeExtraSalvage
m_arrVarFriendlyName=Calculation type
m_arrVarDescription=Determines how the amounts of extra resources are calculated.\n\nFixed - normal loot is always multiplied by a fixed "loot multiplier".\n\nRandom - normal loot is multiplied by a random multiplier. The random value is picked between 1.0 and "loot multiplier". Different multipliers can be set for elerium and alloys and both will be respected in the process of randomization. For instance: max multiplier for elerium is 1.60 and for alloys 1.40, so random loot for elerium is 1.0-1.60 and for alloys 1.0-1.40.

m_arrVarName=SalvageMod.bRandomizeExtraSalvage.False
m_arrVarFriendlyName=Fixed
m_arrVarDescription="" 

m_arrVarName=SalvageMod.bRandomizeExtraSalvage.True
m_arrVarFriendlyName=Random
m_arrVarDescription="" 

m_arrVarName=SalvageMod.ELERIUM_SALVAGE_MOD
m_arrVarFriendlyName=Elerium loot multiplier
m_arrVarDescription=Standard Elerium loot is multiplied by this factor when you decide to hire the salvage teams. If type of calculation is "Random" this will be the maximum possible multiplier for Elerium (the minimum is 1.0).\n\nEXAMPLE:\nElerium loot multiplier = 1.60\nSo you get an offer to retrieve a fixed +60% of elerium OR you get an offer to retrieve random extra 0-60% of elerium (depending on chosen "Calculation type").

m_arrVarName=SalvageMod.ALLOYS_SALVAGE_MOD
m_arrVarFriendlyName=Alloys loot multiplier 
m_arrVarDescription=Standard alloys loot is multiplied by this factor when you decide to hire the salvage teams. If type of calculation is "Random" this will be the maximum possible multiplier for alloys (the minimum is 1.0).\n\nEXAMPLE:\nAlloys loot multiplier = 1.40\nSo you get an offer to retrieve a fixed +40% of alloys OR you get an offer to retrieve random extra 0-40% of alloys (depending on chosen "Calculation type").

m_arrVarName=SalvageMod.ELERIUM_SALVAGE_COST
m_arrVarFriendlyName=Extra Elerium price
m_arrVarDescription=This is the cost paid for each extra piece of Elerium. It is never randomized, always the same. If the price is set to 0 (default setting) the actual price is double the selling price on Grey Market (as set in DefaultGameCore.ini). This also means that the mod cannot be used to get resources for free. At least 1 credit must be paid for each extra piece of resources (1 is the minimum respected price).\n\nEXMAPLE: Elerium price set to 10.\nSo 10 credits must be paid for every additional piece of elerium.\n\nEXMAPLE: Elerium price set to 0 and selling price for Elerium on Grey Market is 1 (from DefaultGameCore.ini).\nSo the actual price of each extra piece of Elerium is 2 credits.

m_arrVarName=SalvageMod.ALLOYS_SALVAGE_COST
m_arrVarFriendlyName=Extra Alloys price
m_arrVarDescription=This is the cost paid for each extra piece of alloys. It is never randomized, always the same. If the price is set to 0 (default setting) the actual price is double the selling price on Grey Market (as set in DefautGameCore.ini). This also means that the mod cannot be used to get extra resources for free. At least 1 credit must be paid for each extra piece of resources (1 is the minimum respected price).\n\nEXMAPLE: Alloys price=10\nSo 10 credits mut be paid for every additional piece of alloys.\n\nEXMAPLE: Alloys price set 0, selling price for alloys on Grey Market is 1 (from DefaultGameCore.ini)). So the actual price of extra alloys is 2 credits per piece.

m_arrVarName=SalvageMod.MissionTypeAllowed.UFOCrash
m_arrVarFriendlyName=Crashed UFO
m_arrVarDescription=Allow salvage teams on crashed UFO missions. 

m_arrVarName=SalvageMod.MissionTypeAllowed.UFOLanded
m_arrVarFriendlyName=Landed UFO
m_arrVarDescription=Allow salvage teams on landed UFO mission. 

m_arrVarName=SalvageMod.MissionTypeAllowed.AlienBase
m_arrVarFriendlyName=Alien Base Assault
m_arrVarDescription=Allow salvage teams on Alien Base Assaults. 

m_arrVarName=SalvageMod.MissionTypeAllowed.ExaltRaid
m_arrVarFriendlyName=EXALT Base Raid
m_arrVarDescription=Allow salvage teams on EXALT base raid mission. 

m_arrVarName=SalvageMod.MissionTypeAllowed.DataRecovery
m_arrVarFriendlyName=Data Recovery
m_arrVarDescription=Allow salvage teams on EXALT data-recovery missions. 

m_arrVarName=SalvageMod.MissionTypeAllowed.ExtractAgent
m_arrVarFriendlyName=Covert Ops Extraction
m_arrVarDescription=Allow salvage teams on covert agent's extractions. 

m_arrVarName=SalvageMod.MissionTypeAllowed.TerrorSite
m_arrVarFriendlyName=Terror Site
m_arrVarDescription=Allow salvage teams on terror missions. 

m_arrVarName=SalvageMod.MissionTypeAllowed.CouncilMission
m_arrVarFriendlyName=Council Mission
m_arrVarDescription=Allow salvage teams on standard (non-DLC) funding council's missions. 

m_arrVarName=SalvageMod.MissionTypeAllowed.Abduction
m_arrVarFriendlyName=Abductions
m_arrVarDescription=Allow salvage teams on alien abductions. 

m_arrVarName=SalvageMod.MissionTypeAllowed.LowFriends
m_arrVarFriendlyName=Low Friends
m_arrVarDescription=Allow salvage teams on Low Friends mission (Slingshot DLC, Zhang's rescue). 

m_arrVarName=SalvageMod.MissionTypeAllowed.ConfoundingLight
m_arrVarFriendlyName=Confounding Light
m_arrVarDescription=Allow salvage teams on Confounding Light mission (Slingshot DLC, train rush). 

m_arrVarName=SalvageMod.MissionTypeAllowed.Gangplank
m_arrVarFriendlyName=Gangplank
m_arrVarDescription=Allow salvage teams on Gangplank mission (Slinshot DLC, battleship raid). 

m_arrVarName=SalvageMod.MissionTypeAllowed.Portent
m_arrVarFriendlyName=Portent
m_arrVarDescription=Allow salvage teams on Portent mission (Progeny DLC, EXALT survivor's rescue). 

m_arrVarName=SalvageMod.MissionTypeAllowed.Deluge
m_arrVarFriendlyName=Deluge
m_arrVarDescription=Allow salvage teams on Deluge mission (Progeny DLC, Annette's rescue on the water dam). 

m_arrVarName=SalvageMod.MissionTypeAllowed.Furies
m_arrVarFriendlyName=Furies
m_arrVarDescription=Allow salvage teams on Furies DLC mission (Progeny DLC, saving psionics from the Abductor). 

m_arrVarName=SequentialOverwatch
m_arrVarFriendlyName=Sequential Overwatch
m_arrVarDescription=<FONT COLOR='#00FF00'>Sequential reaction fire is just one of the options in this improved version of popular "Sequential Overwatch" mod.</FONT> It is a default setting but it can be turned OFF while keeping benefitss of other interesting options.\nThe new optional mechanics (which can be turned on/off even during a mission) include:\n - shots taken in order of distance to target\n - no OW shots allowed through smoke\n - covering fire trigerring on normal overwatch (LW Rebalance style)\n - Sentinel and Rapid Reaction units can take 2 covering fire shots with Covering Fire perk\n - faster Rapid Reaction (next RR shot vs a moving target can trigger faster)

m_arrVarName=SequentialOverwatch.m_bItchyTrigger
m_arrVarFriendlyName=Itchy Trigger
m_arrVarDescription=<FONT COLOR='#00FF00'>Turning this option ON will disable sequential reaction fire.<\FONT> Sequential reaction can be perceived as highly non-realistic therefore with this option ON all overwatch shots will be triggered simultanously.\n\nDefault: OFF.

m_arrVarName=SequentialOverwatch.m_bItchyTrigger.True
m_arrVarFriendlyName=ON
m_arrVarDescription=""

m_arrVarName=SequentialOverwatch.m_bItchyTrigger.False
m_arrVarFriendlyName=OFF
m_arrVarDescription=""

m_arrVarName=SequentialOverwatch.ShootingOrder
m_arrVarFriendlyName=Shooting order
m_arrVarDescription=Relevant to sequential fire. Available options:\n\nBy Distance - units take their reaction shots based on distance to target. Closest unit shoots first, furthest unit shoots last (interesting as it enables "tactical" planning, for instance: guarantees Close Combat Specialist shots be taken before OW shots).\n\nDefault - original mess with no logic behind the order (still interesting for its flavour of uncertainity)

m_arrVarName=SequentialOverwatch.ShootingOrder.False
m_arrVarFriendlyName=Default
m_arrVarDescription=""

m_arrVarName=SequentialOverwatch.ShootingOrder.True
m_arrVarFriendlyName=By Distance
m_arrVarDescription=""

m_arrVarName=SequentialOverwatch.m_bSentinelCoveringFire
m_arrVarFriendlyName=Rapid covering fire
m_arrVarDescription=Units with Covering Fire perk AND Sentinel or Rapid Reaction perk (in base Long War this may happen only with Training Roulette or with "Always Covering Fire" option) can shoot twice vs the same enemy's action.<FONT COLOR='#00FF00'>This option requires "Faster Rapid Reaction" to be also enabled.</FONT>\n\nDefault: OFF.

m_arrVarName=SequentialOverwatch.m_bSplitSentinelOWShots
m_arrVarFriendlyName=Split rapid shots
m_arrVarDescription=Relevant only to "Sentinel covering fire" option. Puts the 2nd shot of units with Sentinel or Rapid Reaction perk at the end of shooting queue. When "Rapid covering fire" is not enabled this option does nothing.\n\nDefault: ON.

m_arrVarName=SequentialOverwatch.m_bFasterRapidReaction
m_arrVarFriendlyName=Faster Rapid Reaction
m_arrVarDescription=Relevant mostly to "Rapid covering fire" (makes it working at all) but useful also vs moving targets. Normally 2nd (and 3rd) Rapid Reaction shot is taken after the target moves 2-3 tiles. This option removes this restriction. However, there's no difference with just one shooter - because the shooter must still get back to cover after his shot and during this animation the target moves and usually travels these 2 tiles. But if there is, for instance, a sniper/gunner on OW and a faster RR unit with standard rifle/shotgun (also on OW) it will be clearly visible that before the sniper/gunner finishes his animation, the RR unit is already back in cover and can shoot its 2nd RR shot almost immediately after the sniper.

m_arrVarName=SequentialOverwatch.m_bFasterCCS
m_arrVarFriendlyName=Faster Close Combat Specialist.
m_arrVarDescription=Close Combat Specalist fires as soon as the enemy tries to move, without waiting for it to move at least 1 tile. Therefore the specialist will react even against a Chryssalid or Berserker trying to approach him from 1 tile range.

m_arrVarName=SequentialOverwatch.m_bAlwaysCoveringFire
m_arrVarFriendlyName=Always Covering Fire
m_arrVarDescription=This option introduces LW Rebalance style of overwatch. Covering fire will trigger even with units without Covering Fire perk - just as everybody had Covering Fire perk. Although it makes the perk redundant and you can do little without being shot at (not even suppress) - it offers a new tactical experience and can be refreshing to a tactical layer. The option can be turned on/off  during an ongoing mission.

m_arrVarName=SequentialOverwatch.m_bSmokeBlocksReactionFire
m_arrVarFriendlyName=Smoke blocks OW shots
m_arrVarDescription=Reaction fire will not trigger if there is smoke between the shooter and the target. Neither shooter nor target needs to be actually IN smoke. It is enough if line of the shot goes through smoke and the OW shot will not trigger.

m_arrVarName=SequentialOverwatch.m_fReactionDistanceThroughSmoke
m_arrVarFriendlyName=Minimum distance to block 
m_arrVarDescription=Smoke will never block OW shots at targets within this distance in tiles. For instance, if the setting is at 2.50 smoke cannot block reaction fire vs a target which is closer than 2.5 tiles (half-tiles are relevant for diagonal positioning). Maximum distance that can be set in the menu is 4 tiles. However, any distance can be manually set in DefaultMiniMods.ini.

m_arrVarName=SequentialOverwatch.m_bSmokeBlocksOW_DenseOnly
m_arrVarFriendlyName=Only Dense Smoke
m_arrVarDescription=""

m_arrVarName=ShadowStep
m_arrVarFriendlyName=Shadow Step
m_arrVarDescription=Allows to define a perk (or list of perks) which grant "immunity" to reaction fire. It means that units with this perk (or perks) do not trigger reaction OW shots (neither normal nor covering fire). However, they still trigger suppression shots - there's no "immunity" to suppression. It is somewhat a double-edged sword - the unit is safe from reaction fire but it also cannot clear OW for its teammates.\n\nThe manager allows to define up to 3 perks. If you want more you need to do it manually in DefaultMiniMods.ini file.

m_arrVarName=ShadowStep.m_arrShadowStepPerks
m_arrVarFriendlyName=Shadow Step Perk
m_arrVarDescription=Unit with this perk does not trigger enemy's reaction fire.  

m_arrVarName=ShadowStep.m_arrShadowStepPerks.1
m_arrVarFriendlyName=Shadow Step Perk 1
m_arrVarDescription=""  

m_arrVarName=ShadowStep.m_arrShadowStepPerks.2
m_arrVarFriendlyName=Shadow Step Perk 2
m_arrVarDescription=""  

m_arrVarName=ShadowStep.m_arrShadowStepPerks.3
m_arrVarFriendlyName=Shadow Step Perk 3
m_arrVarDescription=""

m_arrVarName=ShadowStep.m_arrShadowBusterPerks
m_arrVarFriendlyName=Shadow Buster Perk
m_arrVarDescription=Unit with this perk CAN FIRE REACTION SHOTS at units with Shadow Step ability.  

m_arrVarName=ShadowStep.m_arrShadowBusterPerks.1
m_arrVarFriendlyName=Shadow Buster Perk 1
m_arrVarDescription=""  

m_arrVarName=ShadowStep.m_arrShadowBusterPerks.2
m_arrVarFriendlyName=Shadow Buster Perk 2
m_arrVarDescription=""  

m_arrVarName=ShadowStep.m_arrShadowBusterPerks.3
m_arrVarFriendlyName=Shadow Buster Perk 3
m_arrVarDescription=""

m_arrVarName=ShadowStep.m_bShadowStepOnlyOnMove
m_arrVarFriendlyName=Requires Move
m_arrVarDescription=When this option is checked Shadow Step will only work while the unit is moving - it will not prevent Covering Fire.
  
m_arrVarName=ShadowStep.m_bShadowStepRequiresDash
m_arrVarFriendlyName=Requires Dash
m_arrVarDescription=When this option is checked shadow perks will only work when the unit is dashing - otherwise the unit will normally trigger enemy's reaction fire.

m_arrVarName=ShadowStep.m_bDashGivesShadowStep
m_arrVarFriendlyName=Dash is enough
m_arrVarDescription=When this option is checked dashing units will not trigger enemy's reaction fire - and no perk is required for this.

m_arrVarName=PerkGivesItems
m_arrVarFriendlyName=Perks Give Item Charges
m_arrVarDescription=<FONT COLOR='#00ff00'>(Requires reload or mission's restart)</FONT>This is more of a modding tool than a ready-to-use mod. It adds free charges of certain items (consumables) to certain perks. You pick a perk, an item and the number of charges of the item. Multiple combinations can be defined and 1 perk can grant multiple items. Default settings provide a few examples: Ready For Anything grants 1 free smoke, frag grenade, and flash bang (in base EW that's Bullet Swarm, whoops); Smoke And Mirrors gives 1 free flashbang; Field Medic gives 1 more free medikit.

m_arrVarName=PerkGivesItems.iPerk
m_arrVarFriendlyName=Perk
m_arrVarDescription=Select the perk which will give free charges of some items. Set the number of charges in the very next option and the item in yet another below.\n\nTo remove a combination set the perk or the item to 0 (None). If you want to disable the combination but not remove it - set Charges to 0 instead.

m_arrVarName=PerkGivesItems.iCharges
m_arrVarFriendlyName=Charges
m_arrVarDescription=Set the number of free charges for the item (you choose the item in the option just below). These are free charges or extra charges. If the item is missing in soldier's inventory it will be auto-added to the inventory at start of mission. If the item is equipped in barracks - the charges will be added to what the soldier normally gets from possession of the item. Set charges to 0 to temporarily disable the perk from giving the charges but without removing the whole combination - so it can re-enabled later.

m_arrVarName=PerkGivesItems.iItem
m_arrVarFriendlyName=Item
m_arrVarDescription=Select the item. If the item is missing in soldier's inventory it will be auto-added to the inventory at start of mission. If the item is equipped in barracks - the charges will be added to what the soldier normally gets from possession of the item. To remove a combination set the perk or the item to 0 (None). If you want to disable the setting but not remove it - set Charges to 0 instead.

m_arrVarName=PerkGivesItems.iBlankOptions
m_arrVarFriendlyName=Blank options
m_arrVarDescription=There are at least 2 blank options at the end of list waiting to be filled in. After saving the settings and re-entering the mods menu yet another 2 blank options will appear. If you want more than 2 you can set it here. However, you need to save settings and re-enter Mods Menu to see additional blank options. 

m_arrVarName=ScoutSense
m_arrVarFriendlyName=Scout Sense
m_arrVarDescription=This mod adds a new ability - the scout sense. The ability is granted by a certain perk (defined in options). By default it is a starting perk for Scout class (Long War) or Sniper (base Enemy Within) but you can change it to any perk. The ability allows to hear nearby enemies and point to their location. It works only when no enemies are visible to the squad and it does not detect hidden seekers. The skill improves with soldier's level - starting with just a directional cue and on higher levels adding information about the distance and the type of the enemy.

m_arrVarName=ScoutSense.m_iScoutSensePerk
m_arrVarFriendlyName=Scout Sense Perk
m_arrVarDescription=Choose a perk which will grant the scout sense ability. Default 0 means a starting perk for Scout class (Long War) or Sniper (base Enemy Within) - it will be auto-detected base on information in DefaultGameCore.ini file.

m_arrVarName=ScoutSense.m_iScoutSenseMaxRange
m_arrVarFriendlyName=Maximum range
m_arrVarDescription=Set maximum range in tiles at which enemies can be heard. If the nearest enemy is beyond this range the cue will tell "No trace of enemy".

m_arrVarName=ScoutSense.m_bScoutSensePersistentCues
m_arrVarFriendlyName=Persistent cues
m_arrVarDescription=Checking this option will keep the directional cues visible even after switching from scout to another unit. With the option OFF the cues will disappear after switching to another unit. Visibility of the cues can be also controlled by using the ability button on abilities HUD.

m_arrVarName=ScoutSense.m_bScoutSenseScalesWithRank
m_arrVarFriendlyName=Higher level - better cue
m_arrVarDescription=Checking this option will make the scout ability improve with soldier's rank - increasing the hearing distance and the amount of information. Otherwise the cues will provide full and precise information at maximum range right off the bat.\n\nRegarding the amount of information there are 4 levels of the skill:\nSkill Lvl 0 - only direction to the enemy\nSkill Lvl 1 - direction + vague information about distance\nSkill Lvl 2 - direction + vague distance + type of enemy\nSkill Lvl 3 - direction + distance in tiles + enemy type.\n\nWhen soldier gains the scout sense perk the skill is at level 0. Higher levels of the skill require certain rank - defined in options below.\n\nRegarding the hearing distance there are 7 levels, one for each soldier's rank. The minimum hearing distance is 25 tiles - for Specialist rank. Eeach rank above Specialist increases the hearing range by 1/6 of the difference between maximum range and 25.\nExample: with maximum range set to 40 the hearing distance for subsequent ranks is: 25, 27, 30, 32, 35, 37, 40. At max=50 it would be: 25, 29, 33, 37, 41, 45, 50.\nAs a reference it is worth mentioning that visual range is 18 tiles and maximum range for standard cues which you can normally see on any soldier in base game is 25 tiles.

m_arrVarName=ScoutSense.m_iScoutSenseLvl1Rank
m_arrVarFriendlyName=Vague distance at rank:
m_arrVarDescription=Choose soldier's rank at which the cue will be expanded with vague information about the distance to enemy.

m_arrVarName=ScoutSense.m_iScoutSenseLvl2Rank
m_arrVarFriendlyName=Type of enemy at rank:
m_arrVarDescription=Choose soldier's rank at which the cue will be expanded with information about the type of enemy.

m_arrVarName=ScoutSense.m_iScoutSenseLvl3Rank
m_arrVarFriendlyName=Precise distance at rank:
m_arrVarDescription=Choose soldier's rank at which the vague information about distance will be replaced with precise distance in tiles.

m_arrVarName=ScoutSense.ScoutSenseRange
m_arrVarFriendlyName=""
m_arrVarDescription=Set maximum distance in tiles which is considered vaguely as <XGParam:StrValue0/>

m_arrVarName=FlashBangImproved
m_arrVarFriendlyName=Improved Flashbang Grenade
m_arrVarDescription=Explosion of flashbang grenade decreases sight radius of targets.

m_arrVarName=FlashBangImproved.m_iDisorientedSightRadius
m_arrVarFriendlyName=Sight radius limit
m_arrVarDescription=Set the maximum sight radius for a unit hit by flashbang grenade.

m_arrVarName=FreeActions
m_arrVarFriendlyName=Free Actions
m_arrVarDescription=Make certain actions in game not cost an action point (like using combat stims or grapple etc.).

m_arrVarName=FreeActions.m_bNoCostCombatStims
m_arrVarFriendlyName=Stim And Go
m_arrVarDescription=Using Combat Stims does not cost action point.

m_arrVarName=FreeActions.m_bNoCostGrapple
m_arrVarFriendlyName=Spiderman
m_arrVarDescription=Using Grapple hook does not cost action point.

m_arrVarName=FreeActions.m_iGrappleCooldown
m_arrVarFriendlyName=Grapple Cooldown
m_arrVarDescription=Set cooldown on using a grapple. Strongly recommended with Spiderman in order to forbid numerous grappling actions in one turn.\n<FONT COLOR='#00ff00'>IMPORTANT:</FONT>The cooldown is set in half-turns: 1 - cooldown till end of turn, 2 - cooldown till start of next turn, 3 - cooldown till end of next turn, 4 - cooldown till start of yet next turn, and so on. Set to 0 to remove the cooldown. Hint - set to a very high value (like 100) if you want to allow only 1 usage per mission (LW Rebalance style).

m_arrVarName=FreeActions.m_iGrappleCharges
m_arrVarFriendlyName=Grapple Charges
m_arrVarDescription=Set how many times a grapple can be used - per mission.\n<FONT COLOR='#00ff00'>IMPORTANT: </FONT> Changes during a mission will only affect soldiers who had not yet used their grapple.

m_arrVarName=PerkGivesItems.bEnabled
m_arrVarFriendlyName=""
m_arrVarDescription=Uncheck the option to temporarily disable the perk from giving the charges but without removing the whole combination - so it can be easily re-enabled.

m_arrVarName=AlienHeadIcons
m_arrVarFriendlyName=Improved Enemy Icons
m_arrVarDescription=Makes alien head-icons provide more information - if this is enemy leader, if the enemy is on overwatch, if the enemy is suppressing current unit.

m_arrVarName=AlienHeadIcons.m_fLeaderIconMultiplier
m_arrVarFriendlyName=Leader Icon Scale
m_arrVarDescription=Icon of a leader will be larger. Set the scale here. If you don't want this feature set the scale to 1.0

m_arrVarName=AlienHeadIcons.m_bOWIcons
m_arrVarFriendlyName=Show Overwatch
m_arrVarDescription=When enemy is on overwatch or is suppressing the active unit a small additional icon will indicate these facts.

m_arrVarName=AlienHeadIcons.m_fSquadSizeIconTransparency
m_arrVarFriendlyName=Squad Sight Transp.
m_arrVarDescription=HUD icons for enemies in squad sight range can be partially transparent. 0.0 means no transparency, 1.0 means full transparency (invisible icon). Usually values >0.50 make visible difference.

m_arrVarName=NoDeathMod
m_arrVarFriendlyName=Dead To Wounded
m_arrVarDescription=Soldiers killed in action return as gravely wounded instead BUT at least one soldier must successfully return to base. Soldiers "left behind" will be still dead. 

m_arrVarName=AlienHeadIcons.m_bAllHitChanceOverIcons
m_arrVarFriendlyName=Show All Chances
m_arrVarDescription=Chances to hit and to score critical hit will be both shown over every enemy's icon - without the need to hover mouse over the icon or raise targeting HUD.

m_arrVarName=AlienHeadIcons.HUDColor_Aim
m_arrVarFriendlyName=Chance to Hit
m_arrVarDescription=Pick color.

m_arrVarName=AlienHeadIcons.HUDColor_Aim.1
m_arrVarFriendlyName=<FONT COLOR='#808080'>1</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Aim.2
m_arrVarFriendlyName=<FONT COLOR='#5CD16C'>2</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Aim.3
m_arrVarFriendlyName=<FONT COLOR='#EE1C25'>3</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Aim.4
m_arrVarFriendlyName=<FONT COLOR='#FFD038'>4</FONT>
m_arrVarDescription=""
 
m_arrVarName=AlienHeadIcons.HUDColor_Aim.5
m_arrVarFriendlyName=<FONT COLOR='#B9FFFF'>5</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Aim.10
m_arrVarFriendlyName=<FONT COLOR='#F78000'>10</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Aim.11
m_arrVarFriendlyName=<FONT COLOR='#A09CD6'>11</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Crit
m_arrVarFriendlyName=Chance to Crit
m_arrVarDescription=Pick color.

m_arrVarName=AlienHeadIcons.HUDColor_Crit.1
m_arrVarFriendlyName=<FONT COLOR='#808080'>1</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Crit.2
m_arrVarFriendlyName=<FONT COLOR='#5CD16C'>2</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Crit.3
m_arrVarFriendlyName=<FONT COLOR='#EE1C25'>3</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Crit.4
m_arrVarFriendlyName=<FONT COLOR='#FFD038'>4</FONT>
m_arrVarDescription=""
 
m_arrVarName=AlienHeadIcons.HUDColor_Crit.5
m_arrVarFriendlyName=<FONT COLOR='#B9FFFF'>5</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Crit.10
m_arrVarFriendlyName=<FONT COLOR='#F78000'>10</FONT>
m_arrVarDescription=""

m_arrVarName=AlienHeadIcons.HUDColor_Crit.11
m_arrVarFriendlyName=<FONT COLOR='#A09CD6'>11</FONT>
m_arrVarDescription=""

m_arrVarName=GameSpeedMod
m_arrVarFriendlyName=Game Speed
m_arrVarDescription=Set your own default game speed (the speed of all animations) for tactical missions. Use shortcuts Ctrl + '+' and Ctrl+ '-' to increase/decrease the speed.

m_arrVarName=GameSpeedMod.GAME_SPEED_TACTICAL
m_arrVarFriendlyName=Default Game Speed
m_arrVarDescription=Whenever you start a mission the game speed will be set to this value.

m_arrVarName=GameSpeedMod.GAME_SPEED_MOD_STEP
m_arrVarFriendlyName=+/- Step
m_arrVarDescription=Whenever you press Ctrl+'+' or Ctrl+'-' the game speed will increase/decrease by this value. Game speed will never fall below 0.50 or go above 2.50.

m_arrVarName=MiscMiniMods.m_bAmmoCounter
m_arrVarFriendlyName=Ammo Counter
m_arrVarDescription=Adds a more readable ammo counter on the weapon HUD.

m_arrVarName=MiscMiniMods.m_bAmmoCounterTextStyle
m_arrVarFriendlyName=Text-style counter
m_arrVarDescription=A numerical (text style) counter of ammo will appear next to weapon's name in bottom-right corner of the HUD.

m_arrVarName=MiscMiniMods.m_bShowAmmoSpentByEnemies
m_arrVarFriendlyName=Ammo Spent By Enemy
m_arrVarDescription=Adds info about ammo spent by enemies. Counts only the ammo spent while enemy is visible to the player. If enemy is out of sight for at least 1 turn, the counter resets (he migth have reloaded - player cannot know it).

m_arrVarName=MiscMiniMods.m_bKillsCounter
m_arrVarFriendlyName=Kills' Counter
m_arrVarDescription=Adds info about number of kills scored by a soldier - on current mission and in total.

m_arrVarName=LimitChainPanic
m_arrVarFriendlyName=Limit Chain Panic
m_arrVarDescription=Choose events which will not trigger a panic test on soldiers. It can limit the so called "chain panic" effect in certain situations.

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.0
m_arrVarFriendlyName=Ignore:
m_arrVarDescription=Select event which will not trigger a panic test for unit.

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.1
m_arrVarFriendlyName=Ignore:
m_arrVarDescription=Select event which will not trigger a panic test for unit.

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.2
m_arrVarFriendlyName=Ignore:
m_arrVarDescription=Select event which will not trigger a panic test for unit.

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.3
m_arrVarFriendlyName=Ignore:
m_arrVarDescription=Select event which will not trigger a panic test for unit.

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.4
m_arrVarFriendlyName=Ignore:
m_arrVarDescription=Select event which will not trigger a panic test for unit.

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.N.-1
m_arrVarFriendlyName=None
m_arrVarDescription=""

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.N.0
m_arrVarFriendlyName=Soldier Wounded
m_arrVarDescription=""

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.N.1
m_arrVarFriendlyName=Ally Critically Wounded
m_arrVarDescription=""

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.N.2
m_arrVarFriendlyName=Ally Killed
m_arrVarDescription=""

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.N.4
m_arrVarFriendlyName=Ally Mind Controlled
m_arrVarDescription=""

m_arrVarName=LimitChainPanic.IgnoredMoraleEvent.N.6
m_arrVarFriendlyName=Ally Panicked
m_arrVarDescription=""

m_arrVarName=FlashBangBlinds
m_arrVarFriendlyName=Flash Bang Blinds
m_arrVarDescription=This mod makes all units with "Disoriented" status (applied by flash bang grenades or other way) have their sight radius limited - with all its consequences (range of fire, ability to see and targert enemies). You can define the limit in options.

m_arrVarName=FlashBangBlinds.m_iDisorientedSightRadius
m_arrVarFriendlyName=Sight Radius
m_arrVarDescription=Define the sight radius of units suffering from "Disoriented" status (in tiles).

m_arrVarName=MiscMiniMods.m_bShowPerksOnSoldierLists
m_arrVarFriendlyName=Show Perks On Lists
m_arrVarDescription=When you select a soldier on a soldiers' list a pop-up window displays the list of his perks (same as in barracks).

m_arrVarFriendlyName=Compact HP Display
m_arrVarDescription=Enables alternative HP display in a form of vertical bar showing current % of health. The volume of HP is displayed in numerical form instead. Useful when enemies have tons of HP.\n\n<FONT COLOR='#00FF00'>Use Ctrl+H shortcut to toggle this mod on/off during a mission</FONT>

m_arrVarName=MiscMiniMods.m_bMoreGlamCam
m_arrVarFriendlyName=Action Camera
m_arrVarDescription=Adds close focus camera for a couple of actions.

m_arrVarName=MiscMiniMods.m_bGlamCam_Grapple
m_arrVarFriendlyName=Grappling
m_arrVarDescription=Adds close focus camera for the grappling action.

m_arrVarName=MiscMiniMods.m_bGlamCam_Rocket
m_arrVarFriendlyName=Rocket Shot
m_arrVarDescription=Adds close focus camera for rocket shots.